import pprint

list_names = [['ПУЛБАР'],
              ['Поликарпова Оксана'],
              ['Поваляева Юля'],
              ['Пенкин Александр'],
              ['Юлуева Яна'],
              ['Ганиева Анастасия'],
              ['Королева Виктория'],
              ['Александрова Геля'],
              ['Грачева Анна'],
              ['КУХНЯ'],
              ['Литовский Андрей'],
              ['Атаджанова Лейла'],
              ['Кулдашева Гуля'],
              ['Ананьев Андрей'],
              ['Мырзаева Рая'],
              ['Диля']]

list_skills = [['Должность'],
               ['менеджер'],
               ['помощник официанта'],
               ['менеджер'],
               ['бармен'],
               ['бариста - кассир'],
               ['бариста - кассир'],
               ['вызывной официант'],
               ['вызывной официант'],
               ['Должность'],
               ['повар'],
               ['повар'],
               ['повар'],
               ['ночной повар'],
               ['мойщик'],
               ['мойщик']]

# TODO: Переделать в словарь и потом создать функцию для добавления сотрудников по ФИ(О) и должности

employees = [
    [[['ПУЛБАР']],
     [['Поликарпова Оксана'], ['менеджер']],
     [['Поваляева Юля'], ['официант']],
     [['Пенкин Александр'], ['менеджер']],
     [['Юлуева Яна'], ['шеф-бармен']],
     [['Ганиева Анастасия'], ['бариста-кассир']],
     [['Королева Виктория'], ['бариста-кассир']],
     [['Александрова Геля'], ['вызывной официант']],
     [['Грачева Анна'], ['вызывной официант']],
     ],
    [[['КУХНЯ']],
     [['Литовский Андрей'], ['повар']],
     [['Атаджанова Лейла'], ['повар']],
     [['Кулдашева Гуля'], ['повар']],
     [['Ананьев Андрей'], ['ночной повар']],
     [['Мырзаева Рая'], ['мойщик']],
     [['Диля'], ['мойщик']],
     ]
]

values = [[i[0] for i in employees[0]], [i[0] for i in employees[1]]]
# print(values[0][1][:])
# for lst in values[0]:
#     print(lst[0])
# pprint.pprint(values[0][1])
# pprint.pprint(values[1])