list_names = [['ПУЛБАР'],
              ['Поликарпова Оксана'],
              ['Поваляева Юля'],
              ['Пенкин Александр'],
              ['Юлуева Яна'],
              ['Ганиева Анастасия'],
              ['Королева Виктория'],
              ['Александрова Геля'],
              ['Грачева Анна'],
              ['КУХНЯ'],
              ['Михасик Андрей'],
              ['Атаджанова Лейла'],
              ['Кулдашева Гуля'],
              ['Ананьев Андрей'],
              ['Мырзаева Рая'],
              ['Диля']]

list_skills = [['Должность'],
               ['менеджер'],
               ['помощник официанта'],
               ['менеджер'],
               ['бармен'],
               ['бариста - кассир'],
               ['бариста - кассир'],
               ['вызывной официант'],
               ['вызывной официант'],
               ['Должность'],
               ['шеф-повар'],
               ['повар'],
               ['повар'],
               ['ночной повар'],
               ['мойщик'],
               ['мойщик']]

# TODO: Переделать в словарь и потом создать функцию для добавления сотрудников по ФИ(О) и должности

all_staff = {}
for key in range(0, len(list_names)):
    # print(list_names[key])
    # all_staff.get(str(list_names[key]), str(list_skills[key]))
    all_staff[str(list_names[key])] = list_skills[key]
    # print(len(list_names), len(list_skills))
print(all_staff)

employees = {"['ПУЛБАР']": ['Должность'], "['Поликарпова Оксана']": ['менеджер'],
             "['Поваляева Юля']": ['помощник официанта'], "['Пенкин Александр']": ['менеджер'],
             "['Юлуева Яна']": ['бармен'], "['Ганиева Анастасия']": ['бариста - кассир'],
             "['Королева Виктория']": ['бариста - кассир'], "['Александрова Геля']": ['вызывной официант'],
             "['Грачева Анна']": ['вызывной официант'], "['КУХНЯ']": ['Должность'], "['Михасик Андрей']": ['шеф-повар'],
             "['Атаджанова Лейла']": ['повар'], "['Кулдашева Гуля']": ['повар'], "['Ананьев Андрей']": ['ночной повар'],
             "['Мырзаева Рая']": ['мойщик'], "['Диля']": ['мойщик']}
